#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not "LOGBOOK") date:t
#+OPTIONS: e:t email:nil f:t inline:t num:t p:nil pri:nil prop:nil
#+OPTIONS: stat:t tags:t tasks:t tex:t timestamp:t toc:nil todo:t |:t
#+TITLE: Security Onion BitTorrent Instructions
#+DATE: <2015-06-17 21:43:24 Wednesday>
#+AUTHOR: George Jones <gmj@pobox.com>
#+EMAIL: gmj@pobox.com
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 24.3.50.1 (Org mode 8.2.5h)

This documents the process of downloading the latest [[http://blog.securityonion.net/][Security Onion]]
using BitTorrent, as well as the process of creating the .torrent
file.

* How to download Security Onion using BitTorrent

  Assuming you're running the stock Security Onion with the
  transmission client, do the following to download the latest
  version:

  - [ ] Click on the link
    http://port111.com/securityonion-12.04.5.2-20150617.iso.torrent. This
    will download the .torrent file (to =~/Downloads= by default)
  - [ ] Click on the .torrent file
  - [ ] When transmission comes up with the "Torrent options" window,
    select the .torrent file and click "Open".  The download will
    begin, in ~/Downloads by default
  - [ ] When done, verify the .md5

    #+begin_src sh  :results output :exports both
    cd ~/Downloads/iso
    md5sum securityonion-12.04.5.2-20150617.iso
    cat securityonion-12.04.5.2-20150617.iso.md5
    #+end_src

    #+RESULTS:
    : e35846293dcecf76e5b8d39f6d48c9de  securityonion-12.04.5.2-20150617.iso
    : e35846293dcecf76e5b8d39f6d48c9de  securityonion-12.04.5.2-20150617.iso


*** Download the .md5 file

    #+begin_src sh  :results output :exports both
    cd ~/Downloads/iso
    wget http://iweb.dl.sourceforge.net/project/security-onion/12.04.5.2/securityonion-12.04.5.2-20150617.iso.md5
    #+end_src

    #+RESULTS:
    #+begin_example
    # Wed Jun 17 21:02:25 EDT 2015
    --2015-06-17 21:02:25--  http://iweb.dl.sourceforge.net/project/security-onion/12.04.5.2/securityonion-12.04.5.2-20150617.iso.md5
    Resolving iweb.dl.sourceforge.net (iweb.dl.sourceforge.net)... 2607:f748:10:12::5f:2, 70.38.0.134
    Connecting to iweb.dl.sourceforge.net (iweb.dl.sourceforge.net)|2607:f748:10:12::5f:2|:80... connected.
    HTTP request sent, awaiting response... 200 OK
    Length: 71 [application/octet-stream]
    Saving to: ‘securityonion-12.04.5.2-20150617.iso.md5’

	 0K                                                       100% 10.9M=0s

    2015-06-17 21:02:25 (10.9 MB/s) - ‘securityonion-12.04.5.2-20150617.iso.md5’ saved [71/71]

#+end_example

*** Verify the MD5

    #+begin_src sh  :results output :exports both
    cd ~/Downloads/iso
    md5sum securityonion-12.04.5.2-20150617.iso
    cat securityonion-12.04.5.2-20150617.iso.md5
    #+end_src

    #+RESULTS:
    : e35846293dcecf76e5b8d39f6d48c9de  securityonion-12.04.5.2-20150617.iso
    : e35846293dcecf76e5b8d39f6d48c9de  securityonion-12.04.5.2-20150617.iso


